#Создать список из десяти целых чисел.
#Вывести на экран каждое число, увеличенное на 1.

list = [1,2,3,4,5,6,7,8,9,10]
for list_1 in list:
    print(list_1+1)


#Ввести с клавиатуры строку.
#Вывести эту же строку вертикально: по одному символу на строку консоли.



for str2 in 'Привет всем!':
    print(str2)
  